wsdl/PIXConsumer.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="PIXConsumer" targetNamespace="urn:ihe:iti:pixv3:2007"
    xmlns:tns="urn:ihe:iti:pixv3:2007" xmlns:wsoap11="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:hl7="urn:hl7-org:v3">
    <documentation>Example WSDL for PIX Consumer, receiving update notifications</documentation>
    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="urn:hl7-org:v3"
            xmlns:hl7="urn:hl7-org:v3">
            <!-- Include the message schema -->
            <xsd:include
                schemaLocation="../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201302UV02.xsd"/>
        </xsd:schema>
        <xsd:schema elementFormDefault="qualified" targetNamespace="urn:hl7-org:v3"
            xmlns:hl7="urn:hl7-org:v3">
            <!-- Include the message schema -->
            <xsd:include
                schemaLocation="../schema/HL7V3/NE2008/multicacheschemas/MCCI_IN000002UV01.xsd"/>
        </xsd:schema>
     </types>
    <message name="PRPA_IN201302UV02_Message">
        <part element="hl7:PRPA_IN201302UV02" name="Body"/>
    </message>
    <message name="MCCI_IN000002UV01_Message">
        <part element="hl7:MCCI_IN000002UV01" name="Body"/>
    </message>
    <portType name="PIXConsumer_PortType">
         <operation name="PIXConsumer_PRPA_IN201302UV02">
            <input message="tns:PRPA_IN201302UV02_Message"
                wsaw:Action="urn:hl7-org:v3:PRPA_IN201302UV02"/>
            <output message="tns:MCCI_IN000002UV01_Message"
                wsaw:Action="urn:hl7-org:v3:MCCI_IN000002UV01"/>
        </operation>
    </portType>
    <binding name="PIXConsumer_Binding_Soap12" type="tns:PIXConsumer_PortType">
        <wsoap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="PIXConsumer_PRPA_IN201302UV02">
            <wsoap12:operation soapAction="urn:hl7-org:v3:PRPA_IN201302UV02"/>
            <input>
                <wsoap12:body use="literal"/>
            </input>
            <output>
                <wsoap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="PIXConsumer_Service">
        <port binding="tns:PIXConsumer_Binding_Soap12" name="PIXConsumer_Port_Soap12">
            <wsoap12:address location="http://servicelocation/PIXConsumer_Soap12"/>
        </port>
    </service>
</definitions>
