nexus-ingestion-api/src/test/resources/org/techbd/ingest/soap-test-resources/pix-update-request_1_2.txt

<!-- 
  SOAP 1.2 Envelope wrapping an HL7v3 PRPA_IN201302UV02 message 
  This message is used to indicate a patient record update in PIX/PNR systems.
-->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:v3="urn:hl7-org:v3">
  
  <!-- SOAP Header is empty in this example -->
  <SOAP-ENV:Header/>

  <SOAP-ENV:Body>

    <!-- HL7v3 interaction: Patient Registry Record Revised -->
    <v3:PRPA_IN201302UV02 ITSVersion="XML_1.0">

      <!-- Unique ID for the message: OID + extension -->
      <v3:id root="2.16.840.1.113883.3.72.5.9.1" extension="update-56789"/>

      <!-- Timestamp when message was created: YYYYMMDDHHMMSS format -->
      <v3:creationTime value="20250808153000"/>

      <!-- Type of HL7v3 interaction being performed -->
      <v3:interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201302UV02"/>

      <!-- Message is for production (P) or test (T) -->
      <v3:processingCode code="T"/>

      <!-- Processing mode: T = Training/Test, P = Production -->
      <v3:processingModeCode code="T"/>

      <!-- Acknowledgment expected: AL = Always, NE = Never -->
      <v3:acceptAckCode code="AL"/>

      <!-- Device/system sending the message -->
      <v3:sender typeCode="SND">
        <v3:device classCode="DEV" determinerCode="INSTANCE">
          <v3:id root="1.2.3.4.5.6.7.8.9"/>
        </v3:device>
      </v3:sender>

      <!-- Optional: receiver of the message (useful for multi-party exchanges) -->
      <v3:receiver typeCode="RCV">
        <v3:device classCode="DEV" determinerCode="INSTANCE">
          <v3:id root="9.8.7.6.5.4.3.2.1"/>
        </v3:device>
      </v3:receiver>

      <!-- Main HL7 control structure for the message -->
      <v3:controlActProcess classCode="CACT" moodCode="EVN">

        <!-- Trigger code indicating the event being processed -->
        <v3:code code="PRPA_TE201302UV02" codeSystem="2.16.840.1.113883.1.6"/>

        <!-- Subject of the update: registration event -->
        <v3:subject typeCode="SUBJ">
          <v3:registrationEvent classCode="REG" moodCode="EVN">
            <v3:statusCode code="active"/>

            <!-- Patient whose data was updated -->
            <v3:subject1>
              <v3:patient classCode="PAT">
                <!-- Patient identifier (OID + local ID) -->
                <v3:id root="2.25.987654321" extension="UPDATEDPATIENT001"/>
                <v3:statusCode code="active"/>

                <!-- Patient demographics -->
                <v3:patientPerson>
                  <v3:name>
                    <v3:given>Jane</v3:given>
                    <v3:family>Smith</v3:family>
                  </v3:name>
                  <v3:administrativeGenderCode code="F" codeSystem="2.16.840.1.113883.5.1"/>
                  <v3:birthTime value="19851225"/>
                </v3:patientPerson>
              </v3:patient>
            </v3:subject1>

            <!-- Custodian of the patient record (managing organization) -->
            <v3:custodian>
              <v3:assignedEntity>
                <v3:id root="2.16.840.1.113883.3.72.5.9.10"/>
              </v3:assignedEntity>
            </v3:custodian>
          </v3:registrationEvent>
        </v3:subject>

      </v3:controlActProcess>
    </v3:PRPA_IN201302UV02>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
